Repository: knoopdog/JTL-EAN-Plugin
Catalog: languages/jtl-ean-plugin-*_formal.po
Languages: de_de_formal

source: JTL EAN Plugin requires WooCommerce to be installed and active.
de_de_formal: Das JTL EAN Plugin benötigt WooCommerce zur Funktion.

source: Plugin Activation Error
de_de_formal: Plugin Aktivierungsfehler

source: Product Identifiers
de_de_formal: Produktkennzeichnungen

source: Product identification codes used for inventory management and e-commerce platforms.
de_de_formal: Produktkennzeichnungen für Lagerverwaltung und E-Commerce-Plattformen.

source: Global Trade Item Number (GTIN) or European Article Number (EAN) that uniquely identifies your product worldwide.
de_de_formal: Globale Handelsartikelnummer (GTIN) oder Europäische Artikelnummer (EAN) zur weltweiten eindeutigen Produktidentifikation.

source: Manufacturer Part Number (MPN) assigned by the product manufacturer.
de_de_formal: Herstellernummer (MPN) die vom Produkthersteller vergeben wird.

source: GTIN for this variation
de_de_formal: GTIN für diese Variante

source: MPN for this variation
de_de_formal: MPN für diese Variante

source: JTL EAN Settings
de_de_formal: JTL EAN Einstellungen

source: JTL EAN Plugin Settings
de_de_formal: JTL EAN Plugin Einstellungen

source: This plugin provides EAN/GTIN functionality for WooCommerce with JTL Connector compatibility.
de_de_formal: Dieses Plugin bietet EAN/GTIN-Funktionalität für WooCommerce mit JTL Connector-Kompatibilität.

source: Plugin Statistics
de_de_formal: Plugin-Statistiken

source: Products with GTIN:
de_de_formal: Produkte mit GTIN:

source: Products with MPN:
de_de_formal: Produkte mit MPN:

source: Database Entries:
de_de_formal: Datenbankeinträge:

source: Complete Uninstallation
de_de_formal: Vollständige Deinstallation

source: Warning:
de_de_formal: Warnung:

source: This will completely remove ALL EAN/GTIN data from your database!
de_de_formal: Dies wird ALLE EAN/GTIN-Daten vollständig aus Ihrer Datenbank entfernen!

source: This action will:
de_de_formal: Diese Aktion wird:

source: Delete all GTIN/EAN values from all products
de_de_formal: Alle GTIN/EAN-Werte von allen Produkten löschen

source: Delete all MPN values from all products
de_de_formal: Alle MPN-Werte von allen Produkten löschen

source: Remove all plugin settings
de_de_formal: Alle Plugin-Einstellungen entfernen

source: Deactivate the plugin
de_de_formal: Das Plugin deaktivieren

source: Data Recovery:
de_de_formal: Datenwiederherstellung:

source: After uninstallation, this data cannot be recovered unless you have a database backup!
de_de_formal: Nach der Deinstallation können diese Daten nicht wiederhergestellt werden, es sei denn, Sie haben ein Datenbank-Backup!

source: Are you absolutely sure you want to delete ALL EAN/GTIN data? This cannot be undone!
de_de_formal: Sind Sie absolut sicher, dass Sie ALLE EAN/GTIN-Daten löschen möchten? Dies kann nicht rückgängig gemacht werden!

source: I understand that this will permanently delete all EAN/GTIN data
de_de_formal: Ich verstehe, dass dadurch alle EAN/GTIN-Daten dauerhaft gelöscht werden

source: I confirm that I have a database backup or accept the data loss
de_de_formal: Ich bestätige, dass ich ein Datenbank-Backup habe oder den Datenverlust akzeptiere

source: Completely Uninstall Plugin & Delete All Data
de_de_formal: Plugin vollständig deinstallieren & alle Daten löschen

source: Export Data (Backup)
de_de_formal: Daten exportieren (Backup)

source: Before uninstalling, you can export your EAN/GTIN data for backup purposes.
de_de_formal: Vor der Deinstallation können Sie Ihre EAN/GTIN-Daten zur Sicherung exportieren.

source: Export EAN/GTIN Data (CSV)
de_de_formal: EAN/GTIN-Daten exportieren (CSV)

source: Security check failed.
de_de_formal: Sicherheitsprüfung fehlgeschlagen.

source: You do not have sufficient permissions.
de_de_formal: Sie haben nicht die erforderlichen Berechtigungen.

source: Please confirm both checkboxes to proceed.
de_de_formal: Bitte bestätigen Sie beide Kontrollkästchen, um fortzufahren.

source: JTL EAN Plugin successfully uninstalled! Deleted: %d GTIN entries, %d MPN entries. Database cleaned and plugin deactivated.
de_de_formal: JTL EAN Plugin erfolgreich deinstalliert! Gelöscht: %d GTIN-Einträge, %d MPN-Einträge. Datenbank bereinigt und Plugin deaktiviert.

source: No EAN/GTIN data found to export.
de_de_formal: Keine EAN/GTIN-Daten zum Exportieren gefunden.

source: Global Trade Item Number (GTIN)
de_de_formal: Globale Handelsartikelnummer (GTIN)

source: Manufacturer Part Number (MPN)
de_de_formal: Herstellernummer (MPN)

source: Product ID
de_de_formal: Produkt-ID

source: GTIN value
de_de_formal: GTIN-Wert

source: MPN value
de_de_formal: MPN-Wert

source: Product not found.
de_de_formal: Produkt nicht gefunden.
